Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Absorption That Encapsulates All Merit

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བཅོམ་ལྡན་འདས་ཡངས་པ་ན་ཨ་མྲས་བསྲུངས་པའི་ཚལ་ཆེན་པོའི་ཁང་པ་བརྩེགས་པའི་གནས་ན། དགེ་སློང་ཁྲིའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ།
en: The Blessed One was dwelling in Vaiśālī in the mansion in Āmrapālī’s great grove , together with a great assembly of ten thousand monks. All these monks were foe-destroyers whose defilements were exhausted.

source: ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ།
en: They were without afflictions and controlled.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds were perfectly free, their insight perfectly liberated.

source: ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They were noble beings, great elephants, successful and accomplished.

source: ཁུར་བོར་བ། རང་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had laid down their burden and fulfilled their aims.

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: They had eliminated the bondages of existence and, thanks to their correct knowledge, their minds were perfectly liberated.

source: སེམས་ཐམས་ཅད་ཀྱི་དབང་གི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་།
en: They had obtained supreme perfection in mastering all mental states.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པ། གཟུངས་ཐོབ་པ། སྤོབས་པ་ཐོགས་པ་མེད་པ།
en: There were also twenty thousand bodhisattvas, all of whom were nonreturners. These bodhisattvas had accomplished retention and were unhindered in their eloquence.

source: མངོན་པར་ཤེས་པ་ཐོབ་པ། ཏིང་ངེ་འཛིན་བསྒྲུབ་པ་ལ་མཁས་པ།
en: They had attained the superknowledges and were adept in the practice of absorption.

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། བརྟན་པ་དང་། ཤེས་རབ་དང་། ཐབས་ལ་མཁས་པའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: They had perfect mastery, moreover, in mindfulness, intelligence, realization, steadfastness, insight, and method.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱོད་པའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བླ་མ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱད་པར་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕེལ་བའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་མཐའ་ཡས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་ཁྲི་དང་། ལྷའི་བུ་བཞི་ཁྲི་ཐམས་ཅད་ཀྱང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཤ་སྟག་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་མང་པོ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: Foremost among these twenty thousand were the bodhisattva great being Caryamati, the bodhisattva great being Siṃhamati, the bodhisattva great being Uttaramati, the bodhisattva great being Viśeṣamati, the bodhisattva great being Vardamānamati, the bodhisattva great being Anantamati, the bodhisattva great being Dharmamati, the bodhisattva great being Maitreya, the bodhisattva great being Mañjuśrī­kumāra­bhūta, and the bodhisattva great being Nārāyaṇa. Together with them were forty thousand gods, all of whom were thoroughly immersed in the Great Vehicle, as well as Śakra, Brahmā, and many world protectors.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: Surrounded and revered by this retinue of many hundreds of thousands, the Blessed One taught the Dharma.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ཤིན་ཏུ་སྙིང་པོར་གྱུར་ཏེ། མུ་སྟེགས་བྱེད་ཀྱི་ཚོགས་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏོ། །
en: On this occasion, the Blessed One’s teaching was particularly pithy and overwhelmed the masses of non-Buddhists.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Afterward the bodhisattva great being Nārāyaṇa rose up from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms together, he bowed toward the Blessed One and supplicated him as follows.

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་འདི་ཤིན་ཏུ་སྙིང་པོར་གྱུར་ཏེ།
en: “Blessed One, this teaching of yours is exceedingly pithy.

source: མུ་སྟེགས་ཅན་ངན་པ་སྤྱོད་པ་ཅན་དང་། ཀུན་ཏུ་རྒྱུ་གྲངས་མ་མཆིས་པ་དང་། གཅེར་བུ་པ་ལ་སོགས་པ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ་མཛེས་པར་གྱུར་ལགས་སོ། །
en: It is exquisite indeed, and overwhelms everyone, including misguided non-Buddhists, the countless wandering mendicants, and the naked ascetics.

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལེགས་པར་ཡོངས་སུ་གཟུང་དུ་གསོལ།
en: Accordingly, Blessed One, please take the bodhisattva great beings under your care,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་གདགས་སུ་གསོལ།
en: please give your aid to the bodhisattva great beings,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་བསྐྱང་དུ་གསོལ།
en: and please keep the bodhisattva great beings in your protection.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གསོལ།
en: Please arouse the bodhisattva great beings’ roots of goodness.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གཟེངས་བསྟོད་པ་དང་། ཡང་དག་པར་དགའ་བར་མཛད་པ་དང་། ཡང་དག་པར་བསྟན་པར་གསོལ།
en: Please exalt the bodhisattva great beings, delight them, and instruct them thoroughly.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་གདུང་རྒྱུན་མི་འཆད་པའི་ཆོས་ཀྱི་ཚུལ་ཡོངས་སུ་གཟུང་དུ་གསོལ།
en: Please look after the Buddha’s legacy, the continuity of the bodhisattva great beings’ spiritual tradition.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་གསོལ།
en: “Please do not forsake sentient beings.

source: ཇི་ལྟ་བུའི་ཚུལ་གྱིས་ཆོས་ཀྱི་ཕན་གདགས་པས་མྱ་ངན་ལས་འདས་པར་མཆི་བའི་ལམ་བསྟན་པར་གསོལ།
en: Please show the path by which, with the aid of the teachings, one may pass beyond suffering.

source: དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཉམས་པར་མི་འགྱུར་བ་དང་། ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: [Please ensure] that even though the thus-gone ones pass beyond suffering, the bodhisattva great beings do not stray from unsurpassed and perfectly complete awakening—that they do not stray at all.

source: སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་། མི་འབྲལ་བ་དང་།
en: [Please ensure] that they always meet the Buddha, that they hear the Dharma, and that the Saṅgha is honored.

source: བསྐྱུད་ངས་པ་མ་མཆིས་པའི་ཆོས་ཅན་གྱི་སླད་དུ་དྲན་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། ཆོས་ཀྱི་དགོངས་པ་རྟོགས་པར་འགྱུར་བའི་སླད་དུ་བློ་གྲོས་དང་ལྡན་པར་འགྱུར་བ་དང་། དོན་རྟོགས་པ་རྗེས་སུ་འཐོབ་པའི་སླད་དུ་རྟོགས་པ་དང་ལྡན་པར་འགྱུར་བ་དང་།
en: [Please ensure] that they have mindfulness so as to not become forgetful, that they have intelligence so as to realize the intended meaning of the teachings, and that they become realized so as to accomplish realization of the truth.

source: རང་གི་སེམས་ཡོངས་སུ་དག་པའི་སླད་དུ་ངོ་ཚ་དང་ལྡན་པར་འགྱུར་བ་དང་། སྡིག་པའི་ལས་ཐམས་ཅད་སྤོང་བའི་སླད་དུ་ཁྲེལ་ཡོད་པ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་།
en: [Please ensure] that they have a sense of conscience in order to purify their minds, and that they have the keen sense of modesty they need in order to give up all negative actions.

source: ཆོ་ག་དང་སྤྱོད་པ་ཕུན་སུམ་ཚོགས་པའི་སླད་དུ་བརྟན་པ་དང་ལྡན་པར་འགྱུར་བ་དང་།
en: [Please ensure] that they have the steadfastness necessary for perfect conduct and religious observance.

source: ཉོན་མོངས་པ་ཐམས་ཅད་བསལ་བའི་སླད་དུ་དཔའ་བར་འགྱུར་བ་དང་། འཁོར་ཐམས་ཅད་ཀྱི་ནང་དུ་བག་ཚ་བ་དང་བྲལ་བའི་སླད་དུ་སྲན་ཐུབ་པར་འགྱུར་བར་མཛད་དུ་གསོལ།
en: Please ensure that they have the bravery with which to eradicate their afflictions, and that they have the fortitude to be free of anxiety in the midst of any assembly.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བསོད་ནམས་ཡོངས་སུ་མི་ཉམས་པ་དང་། ཆོས་ཡོངས་སུ་མི་ཉམས་པ་དང་། ཤེས་བ་ཡོངས་སུ་མི་ཉམས་པ་དང་། ཡེ་ཤེས་ཡོངས་སུ་མི་ཉམས་པར་འགྱུར་བ་ལགས།
en: “Blessed One, how come the bodhisattva great beings do not diminish in merit, in spirituality, in insight, and in wisdom?

source: ཇི་ལྟར་ན་ལྷག་པའི་བསམ་པ་བརྟན་པས་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་མི་ཉམས་པ་དང་།
en: How do they become sufficiently stable in their altruism to prevent their mind of awakening from decreasing?

source: མྱ་ངན་ལས་འདས་པའི་མཐར་ཐུག་གི་བར་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མཛའ་བ་བརྟན་པ་དང་།
en: [How do] they keep a solid sense of kinship with beings all the way through until they finally pass beyond suffering?

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བགྱིད་པ་དང་།
en: [How do] they practice what they preach?

source: སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ་གནས་པས་སེམས་ཅན་རྣམས་ལ་མི་སླུ་བ་དང་།
en: [How do] they live for the sake of practicing the Buddha’s teachings in all their completeness, and thus without deceiving beings?

source: གཏོང་བ་ཐམས་ཅད་རྗེས་སུ་འཇུག་པས་མ་བསྟན་པའི་སྦྱིན་པ་དང་ལྡན་པ་དང་།
en: [How can] they engage in every type of giving, and thus attain the untaught generosity?

source: སྡོམ་པ་གསུམ་ཡོངས་སུ་དག་པ་ལ་གནས་པས་མ་བསྟན་པའི་ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་།
en: [How can] they live by the purity of the three sets of vows, and thus attain the untaught discipline?

source: གནོད་སེམས་མེད་པའི་ཡིད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པས་མ་བསྟན་པའི་བཟོད་པ་དང་ལྡན་པ་དང་།
en: [“How can] they, with no malevolence in their minds, remain impartial toward all beings, and thus attain the untaught patience?

source: ཡོངས་སུ་མི་སྐྱོ་བའི་ཡིད་ཀྱིས་དོན་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པས་མ་བསྟན་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ་དང་།
en: [How can] they accomplish all their aims with an indefatigable attitude, and thus attain the untaught diligence?

source: དྲན་པ་དང་། ཤེས་བཞིན་ལ་མཁས་ཏེབསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་མི་གནས་པས་མ་བསྟན་པའི་བསམ་གཏན་དང་ལྡན་པ་དང་།
en: [How can] they become skilled in mindfulness and vigilance, and, without dwelling in any type of concentration, absorption, or equipoise, attain the untaught concentration?

source: ལྟ་བ་ཐམས་ཅད་དང་བྲལ་ཞིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྣང་བ་ཐོབ་པས་མ་བསྟན་པའི་ཤེས་རབ་དང་ལྡན་པ་དང་།
en: [How can] they be free of any viewpoint, and, as they attain illumination regarding all the Buddha’s teachings, achieve the untaught wisdom?

source: སེམས་ཅན་རྣམས་བསྡུ་བའི་དངོས་པོ་བཞིས་བསྡུ་བ་ལ་ཤིན་ཏུ་བརྩོན་པས་བསྡུ་བ་ཤིན་ཏུ་བསྡུས་པ་དང་།
en: [How can] they exert themselves unrelentingly in attracting beings using the four means of drawing them in, and thus become exceedingly magnetizing?

source: ལྷ་དང་མིའི་སྐྱེ་བ་ཐམས་ཅད་ལ་མི་རྟག་པར་ཡིད་ལ་བགྱིད་པ་ལ་བརྩོན་པས་རེ་བ་མ་མཆིས་པ་དང་།
en: [How can] they endeavor to engage mentally with the transience of the life of gods and humans, and thus become free of expectations?

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ལ་ལེགས་པར་གནས་ཤིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་འདོད་པ་དང་བྲལ་བས་སྒོའི་ཐེམ་པའི་རྟེན་ལྟ་བུ་དང་།
en: [How can] they be as steadfast as a doorsill as they set their minds on omniscience itself and stay free of the wish to be a śrāvaka or solitary buddha?

source: ཆོས་ཀྱི་དབང་དུ་བགྱིད་ཀྱི་འདོད་པའི་དབང་དུ་མི་བགྱིད་པ་དང་།
en: “[How can] they stay under the influence of the Dharma and not the influence of their desires?

source: ཆོས་ཀྱི་རྒྱལ་སྲིད་དོན་དུ་གཉེར་བར་བགྱིད་ཀྱི་ལྷ་དང་མིའི་རྒྱལ་སྲིད་དོན་དུ་མི་གཉེར་བ་དང་།
en: [How can] they strive for the dominion of the Dharma rather than the dominion of humans and gods?

source: སངས་རྒྱས་ཀྱིས་གནང་བའི་ཚིག་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་འགྱུར་བ་དང་།
en: [How do] they expound on the teachings using the words prescribed by the Buddha?

source: ཆོས་ཀྱིས་འཚོ་བར་འགྱུར་གྱི་ཟང་ཟིང་གིས་མི་འཚོ་བ་དང་།
en: [How can] they sustain themselves on the Dharma and not on material things?

source: ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་འདོད་ཆགས་དང་བྲལ་བར་འགྱུར་བ་དང་།
en: [How can] they become free of desire to possess anything?

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མ་མཆིས་པའི་སེམས་དང་ལྡན་པས་ཞེ་སྡང་དང་བྲལ་བར་འགྱུར་བ་དང་།
en: [How can] they be without enmity toward any being and thus become free of anger?

source: ཆོས་ཐམས་ཅད་ལ་གཏི་མུག་གི་མུན་པ་དང་བྲལ་བས་གཏི་མུག་དང་བྲལ་བར་འགྱུར་བ་དང་།
en: [How can] they free themselves from the darkness of delusion regarding all phenomena and thus become free of delusion?

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བས་བདུད་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་།
en: [How can] they free themselves of the subsidiary disturbing emotions and thus genuinely transcend all demons?

source: སྒོ་ཐམས་ཅད་ནས་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པས་ཐབས་ལ་མཁས་པར་འགྱུར་བ་ལགས།
en: [How can] they become skilled in all the various ways of dedicating merit and thus gain skill in methods?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་གསུམ་གྱི་བདག་པོ་བསྲེད་མེད་ཀྱི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then answered the bodhisattva great being Nārāyaṇa, lord of the trichiliocosm,

source: སྲེད་མེད་ཀྱི་བུ་ཁྱོད་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, Nārāyaṇa, excellent.

source: ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱིར་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་སྲེད་མེད་ཀྱི་བུ་ཁྱོད་ལེགས་སོ། །
en: It is excellent of you to have thought to ask such a question of the Thus-Gone One for the sake of the bodhisattvas.

source: སྲེད་མེད་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Accordingly, Nārāyaṇa, you should listen carefully and keep in mind what I am about to say.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོན་ཏན་གྱི་ཁྱད་པར་འདི་དག་དང་། གཞན་དག་ཀྱང་ཐོབ་པར་འགྱུར་བ་ངས་བཤད་དོ། །
en: I will now explain how the bodhisattva great beings can attain all these particular qualities as well as others.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྲེད་མེད་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: The bodhisattva great being Nārāyaṇa said, “Wonderful, Blessed One!” He then listened attentively, as the Blessed One had advised him.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One began,

source: སྲེད་མེད་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Nārāyaṇa, there is something known as the bodhisattva great beings’ absorption that encapsulates all merit .

source: དེ་ལ་བརྟེན་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བསོད་ནམས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར།
en: Based on it, bodhisattva great beings’ merit will not be depleted,

source: ཆོས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར།
en: their dharmas will not diminish,

source: ཤེས་རབ་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར།
en: their insight will not diminish,

source: ཡེ་ཤེས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར།
en: and their wisdom will not diminish.

source: སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་འབྲལ་བར་མི་འགྱུར།
en: They will always meet the Buddha, hear the Dharma, and the Saṅgha will be honored.

source: བསྡུ་བའི་དངོས་པོ་བཞི་ལ་བརྩོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་གནས་པ་ནས།
en: Based on it, they will be able to exert themselves in the four means of magnetizing, live by not forsaking any being,

source: སྒོ་ཐམས་ཅད་ནས་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པས། ཐབས་ལ་མཁས་པར་འགྱུར་བའི་བར་དེ་དག་དང་།
en: and become skilled in the various ways of dedicating merit, thus gaining skill in method.

source: ཡོན་ཏན་གྱི་ཁྱད་པར་གཞན་དག་དང་ཡང་ལྡན་པར་འགྱུར་རོ། །
en: These and other special qualities will they attain.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདིའི་མིང་ཙམ་བཀའ་སྩལ་ནས་ཅང་མི་གསུང་བར་གྱུར་ཏོ། །
en: In this way, the Blessed One merely uttered the phrase absorption that encapsulates all merit , but did not describe it any further.

source: དེ་ནས་དེའི་ཚེ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཅེས་བྱ་བ་ཚན་པོ་ཆེ་ཆེན་པོ་སྟོབས་ཆེན་པོ་དང་ལྡན་པ་ཞིག་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ན་གནས་སོ། །
en: Living in Vaiśālī at that time was a mighty strongman named Vimalatejā.

source: དེ་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Now he began to think to himself,

source: བདག་ནི་ཚན་པོ་ཆེ་ཆེན་པོ་སྟོབས་པོ་ཆེའི་ཤུགས་དང་ལྡན་པ་སྟེ།
en: “I am someone who has the great strength that comes with being a mighty and powerful strongman.

source: འཛམ་བུའི་གླིང་འདིའི་སེམས་ཅན་ལ་འདི་ལྟ་སྟེ། སྟོབས་སམ་སྤྲོ་བ་བདག་དང་མཉམ་པ་ཡང་མེད་ན་ལྷག་པ་ལྟ་ག་ལ་ཡོད་སྙམ་མོ། །
en: Among the beings in this world, there does not seem to be anyone who rivals me in power or vigor, so who could be superior to me, I wonder?”

source: དེས་དགེ་སྦྱོང་གོའུ་ཏ་མ་སྟོབས་པོ་ཆེའི་ཤུགས་དང་ལྡན་ཏེ།
en: He continued to ponder, “The monk Gautama is said to have a great deal of power.

source: སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་ཞིང་སྲེད་མེད་ཀྱི་བུའི་ལུས་ཐོབ་བོ། །ཞེས་གྲག་གོ་སྙམ་མོ། །
en: It is said that his power consists of the ten strengths, and that he has a body like that of Nārāyaṇa.”

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He then thought,

source: བདག་དགེ་སྦྱོང་གོའུ་ཏ་མའི་ཐད་དུ་སོང་ལ། བཅོམ་ལྡན་འདས་
en: “I should go find this monk Gautama.

source: དེ་ཅི་འདྲ་བ་དང་། བདག་ཅི་འདྲ་བ་སད་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: That way I can really make a comparison of this ‘Blessed One’ and myself, and resolve my doubts.”

source: དེ་ནས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས།
en: So the mighty strongman Vimalatejā left the great city of Vaiśālī and

source: ཨ་མྲས་བསྲུངས་པའི་ཚལ་ཆེན་པོའི་ཁང་པ་བརྩེགས་པའི་གནས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: went to the mansion in Āmrapālī’s great grove .

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འཁོར་འབུམ་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ།
en: There was the Thus-Gone One, the foe-destroyer, the completely perfect Buddha, surrounded and revered by his hundred-thousandfold retinue.

source: སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོས་ཆོས་སྟོན་ཅིང་། རིའི་རྒྱལ་པོ་རི་རབ་རྒྱ་མཚོའི་ནང་ནས་མངོན་པར་འཕགས་པ་དང་འདྲ་ལ་ཀུན་ནས་མཛེས་ཤིང་བལྟ་བས་ཆོག་མི་ཤེས་པ་མཐོང་ངོ་། །
en: Vimalatejā saw the great power with which the Buddha taught the Dharma. In his magnificent beauty the Buddha seemed like the lofty king of mountains in the midst of the ocean, and Vimalatejā could not stop looking at him.

source: དེས་བཅོམ་ལྡན་འདས་མཐོང་མ་ཐག་ཏུ་དགའ་བ་དང་དང་བ་དང་མཆོག་ཏུ་དགའ་བ་ཆེན་པོ་ཐོབ་བོ། །དེ་དགའ་བ་དང་དང་བ་དང་མཆོག་ཏུ་དགའ་བ་ཆེན་པོ་ཐོབ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་གཏུགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་སྟེ།
en: As soon as he laid eyes on the Blessed One, he felt pleased, delighted, and overjoyed. In this state, he touched the Blessed One’s feet, circled him, and then sat off to one side.

source: བཅོམ་ལྡན་འདས་འབའ་ཞིག་ལ་ཕྱག་འཚལ་ཞིང་མགོ་བོར་ཐལ་མོ་སྦྱར་ནས། བཅོམ་ལྡན་འདས་ལ་རྟོག་ཅིང་འདུག་གོ། །
en: He bowed—though to the Blessed One only—and with his palms together at his head, sat there with his attention on the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ཀྱི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས།
en: The Blessed One realized that the mighty strongman Vimalatejā’s state of mind was sincere.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་གདུལ་བའི་ཕྱིར་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: In order to tame Vimalatejā’s pride, self-importance, and arrogance, he asked the elder, great Maudgalyāyana,

source: མཽད་གལ་གྱི་བུ་ཁྱོད་སོང་ལ། ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མའི་ཕྱིར། མདའ་འཕངས་པ་གང་ཡིན་པ་དེ་འདིར་ལོང་ཤིག །
en: “Go and fetch me the arrow I shot for the sake of the Śākya maiden Gopā when I was a bodhisattva.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The venerable Maudgalyāyana then replied to the Blessed One,

source: བཅོམ་ལྡན་འདས་གནམ་མདའ་དེ་ག་ལ་མཆིས་པ་བདག་གིས་མ་མཐོང་ལགས་སོ། །
en: “Where is that arrow? I do not see it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཕྱག་གཡས་པ་ནས་སྣང་བར་བྱེད་པ་ཞེས་བྱ་བའི་འོད་ཟེར་ཅིག་བཏང་སྟེ།
en: At that moment the Blessed One emitted a light known as Illumination from his right hand.

source: འོད་ཟེར་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བར་བྱས་སོ། །
en: This light illuminated the entire great trichiliocosm,

source: དེ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདིའི་ཁོར་ཡུག་ཆེན་པོ་གང་ཡིན་པ་དེ་ན་མདའ་དེ་འདུག་པ་སྣང་བར་གྱུར་ཏོ། །
en: and then it lit up the place where the arrow was, at the outer periphery of this buddhafield.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One said to the venerable great Maudgalyāyana,

source: མཽད་གལ་གྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་ཁོར་ཡུག་ཆེན་པོ་ན་མདའ་འདུག་པ་དེ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: “Do you see that arrow at the outer periphery of the world system?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: He replied, “Blessed One, yes, I do see it.”

source: མཽད་གལ་གྱི་བུ་ཁྱོད་སོང་ལ་མདའ་དེ་ལོང་ཤིག །
en: “So, Maudgalyāyana, go and fetch it.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས
en: “Certainly, Blessed One,” he replied.

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏེ། འཁོར་ཐམས་ཅད་ཀྱི་ནང་ནས་མི་སྣང་བར་གྱུར་ནས།
en: Following the Blessed One’s orders, the venerable great Maudgalyāyana vanished in front of the entire assembly.

source: དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པའི་ལག་པ་བསྐུམ་པ་ལས་རྐྱོང་བའམ་བརྐྱང་བ་ལས་སྐུམ་པ་བཞིན་དུ་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཁོར་ཡུག་ཆེན་པོ་དེ་ནས་མདའ་དེ་བླངས་ཏེ
en: And immediately, in one instant, one moment—like the span of time it takes a strong person to stretch out and retract his arm—he had retrieved the arrow from the outer periphery of the world system.

source: བཅོམ་ལྡན་འདས་ལ་ཕུལ་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He gave it to the Blessed One, and asked,

source: བཅོམ་ལྡན་འདས་ཅི་གནམ་མདའ་འདི་བྱང་ཆུབ་སེམས་དཔས་ཡབ་ཡུམ་ལས་བྱུང་བའི་སྟོབས་ཀྱིས་འཕངས་པ་ལགས་སམ། འོན་ཏེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཕངས་པ་ལགས།
en: “Blessed One, was the strength with which the Bodhisattva shot this arrow hereditary or miraculous?”

source: བཀའ་སྩལ་པ།
en: The Blessed One said,

source: མཽད་གལ་གྱི་བུ་ཡབ་ཡུམ་ལས་བྱུང་བའི་སྟོབས་ཀྱིས་མདའ་འཕངས་པ་ཡིན་གྱི། རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཕངས་པ་ནི་མ་ཡིན་ནོ། །
en: “Maudgalyāyana, the strength with which I shot it was hereditary; it was not shot with any miraculous strength.

source: མཽད་གལ་གྱི་བུ་གལ་ཏེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཕངས་སུ་ཟིན་ན་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པར་འགྲོ་བར་འགྱུར་རོ། །
en: If it had been shot with miraculous power, Maudgalyāyana, it could have traveled infinitely to any of the countless universes.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡབ་ཡུམ་ལས་བྱུང་བའི་སྟོབས། རང་གི་སྟོབས་བསོད་ནམས་ཡོངས་སུ་སྨིན་པ་ལས་སྐྱེས་པ་དེ་ཇི་ལྟ་བུ་ཞིག་ལགས།
en: Maudgalyāyana said, “Blessed One, please describe the hereditary strength you had as a bodhisattva great being, which emerged out of the ripening of your merit.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One explained,

source: མཽད་གལ་གྱི་བུ་མི་བཅུའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་གླང་གཅིག་གི་སྟོབས་སོ། །
en: “Maudgalyāyana, the strength of ten men is the same as the strength of one ox.

source: གླང་བཅུའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་གླང་སྔོན་པོ་གཅིག་གི་སྟོབས་སོ། །
en: The strength of ten oxen is the same as the strength of one blue ox.

source: གླང་སྔོན་པོ་བཅུའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་གླང་པོ་ཆེ་ཐ་མལ་པ་གཅིག་གི་སྟོབས་སོ། །
en: The strength of ten blue oxen is the same as the strength of one ordinary elephant.

source: གླང་པོ་ཆེ་ཐ་མལ་པ་བཅུའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་གླང་པོ་ཆེ་འཇིགས་སུ་རུང་བ་གཅིག་གི་སྟོབས་སོ། །
en: The strength of ten ordinary elephants is the same as the strength of one fearsome elephant.

source: གླང་པོ་ཆེ་འཇིགས་སུ་རུང་བ་བཅུའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་གླང་པོ་ཆེ་གླང་པོ་ཆེ་མོ་འདྲ་བ་གཅིག་གི་སྟོབས་སོ། །
en: The strength of ten fearsome elephants is the same as the strength of one elephant akin to a female elephant.

source: གླང་པོ་ཆེ་གླང་པོ་ཆེ་མོ་འདྲ་བ་བཅུའི་སྟོབས་གང་ཡིན་པ་དེ་ནི་དགོན་པའི་གླང་པོ་ཆེ་གཅིག་གི་སྟོབས་སོ། །
en: The strength of ten elephants akin to female elephants is the same as the strength of one wild elephant.
